---
kind: other
id: Properties.T:Autodesk.Revit.DB.SubTransaction
source: html/9f4fae63-a297-c685-7d1a-99b0fa0c085b.htm
---
# SubTransaction Properties

Specifies whether the .NET object represents a valid Revit entity.